
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |    Add |   🟡 Change |    Destroy |
|:---------:|-------:|-----------:|-----------:|
|     ✅     |      0 |          3 |          0 |
## Affected resources by action

|  Action  | Resources                                                                         |
|:--------:|:----------------------------------------------------------------------------------|
|    🟡     | `module.vpn.module.google_client.aws_secretsmanager_secret_version.current`       |
|    🟡     | `module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket.access_log[0]`         |
|    🟡     | `module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket_policy.access_logs[0]` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.vpn.module.google_client.data.external.secret_value will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "secret_value" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/vpn.google_client/assets/get_secret.py",
          + "us-west-1",
          + "arn:aws:secretsmanager:us-west-1:493370826424:secret:google_client20240705174358177800000017-yo288K",
          + "arn:aws:iam::493370826424:role/ih-tf-aws-control-493370826424-admin",
        ]
      + result  = (known after apply)
    }

  # module.vpn.module.google_client.aws_secretsmanager_secret_version.current will be updated in-place
  ~ resource "aws_secretsmanager_secret_version" "current" {
        id             = "arn:aws:secretsmanager:us-west-1:493370826424:secret:google_client20240705174358177800000017-yo288K|terraform-20240705174406049400000021"
      ~ version_stages = [
          - "AWSCURRENT",
            # (1 unchanged element hidden)
        ]
        # (5 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.data.aws_iam_policy_document.access_logs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "access_logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::openvp-access-log-20240705174355580400000004/AWSLogs/493370826424/*",
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::027434742980:root",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket.access_log[0] will be updated in-place
  ~ resource "aws_s3_bucket" "access_log" {
      ~ force_destroy               = false -> true
        id                          = "openvp-access-log-20240705174355580400000004"
        tags                        = {}
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_s3_bucket_policy.access_logs[0] will be updated in-place
  ~ resource "aws_s3_bucket_policy" "access_logs" {
        id     = "openvp-access-log-20240705174355580400000004"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:PutObject"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::027434742980:root"
                        }
                      - Resource  = "arn:aws:s3:::openvp-access-log-20240705174355580400000004/AWSLogs/493370826424/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDAsICJjaGFuZ2UiOiAzLCAiZGVzdHJveSI6IDB9fQ==
```
</details>